
## :white_check_mark: Apply Succeeded (sendgrid-data-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/10125)



<pre><code>Apply complete! Resources: 29 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Reading...
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Reading...
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Reading...
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Read complete after 0s [id=4171847473]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Read complete after 0s [id=4250039221]
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Read complete after 0s [id=1349007126]
data.aws_region.pocket-shared-vpc_current_region_847136C5: Reading...
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Reading...
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Reading...
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Read complete after 0s [id=410318598490]
data.aws_region.pocket-shared-vpc_current_region_847136C5: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Read complete after 0s [id=/SendGridData/CircleCI/Dev/SERVICE_HASH]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Read complete after 0s [id=/Shared/Vpc]
data.aws_vpc.pocket-shared-vpc_405D247E: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Read complete after 0s [id=/SendGridData/Dev/SENTRY_DSN]
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Read complete after 0s [id=ZCSIDA846KWLN]
data.aws_vpc.pocket-shared-vpc_405D247E: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Reading...
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Reading...
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA will be created
  + resource "aws_acm_certificate" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA" {
      + arn                       = (known after apply)
      + domain_name               = "sendgrid-data.getpocket.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "sendgrid-data.getpocket.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "sendgrid-data.getpocket.dev",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637 will be created
  + resource "aws_acm_certificate_validation" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422 will be created
  + resource "aws_api_gateway_base_path_mapping" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422" {
      + api_id      = (known after apply)
      + domain_name = "sendgrid-data.getpocket.dev"
      + id          = (known after apply)
      + stage_name  = "dev"
    }

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 will be created
  + resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4 will be created
  + resource "aws_api_gateway_domain_name" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "sendgrid-data.getpocket.dev"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)
    }

  # aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884 will be created
  + resource "aws_api_gateway_integration" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7 will be created
  + resource "aws_api_gateway_method" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204 will be created
  + resource "aws_api_gateway_resource" "apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "events"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018 will be created
  + resource "aws_api_gateway_rest_api" "apigateway-lambda_api-gateway-rest_FD4A1018" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "SendGridData-Dev-API-Gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be created
  + resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26 will be created
  + resource "aws_cloudwatch_log_group" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/SendGridData-Dev-ApiGateway-Function"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B will be created
  + resource "aws_codedeploy_app" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Lambda"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "SendGridData-Dev-ApiGateway-Lambda"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54 will be created
  + resource "aws_codedeploy_deployment_group" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54" {
      + app_name                    = "SendGridData-Dev-ApiGateway-Lambda"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.LambdaAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "SendGridData-Dev-ApiGateway-Lambda"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags_all                    = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }
    }

  # aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA will be created
  + resource "aws_iam_policy" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SendGridData-Dev-ApiGateway-ExecutionRolePolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "firehose:PutRecordBatch",
                          + "firehose:PutRecord",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:firehose:*:*:deliverystream/dev-sendgrid-events-to-braveheart"
                    },
                  + {
                      + Action   = "cloudwatch:PutMetricData"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633 will be created
  + resource "aws_iam_role" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SendGridData-Dev-ApiGateway-ExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B will be created
  + resource "aws_iam_role" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SendGridData-Dev-ApiGateway-CodeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2 will be created
  + resource "aws_iam_role_policy_attachment" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SendGridData-Dev-ApiGateway-ExecutionRole"
    }

  # aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87 will be created
  + resource "aws_iam_role_policy_attachment" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRoleForLambda"
      + role       = "SendGridData-Dev-ApiGateway-CodeDeployRole"
    }

  # aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F will be created
  + resource "aws_lambda_alias" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F" {
      + arn              = (known after apply)
      + function_name    = "SendGridData-Dev-ApiGateway-Function"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "DEPLOYED"
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be created
  + resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "index.js.zip"
      + function_name                  = "SendGridData-Dev-ApiGateway-Function"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "W3H4FeYY1XpXur5FoFbOhDmOD96dMyqqzRIkSf0dED4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_CLOUDWATCH_METRIC_NAMESPACE"   = "SendGridData-Dev"
              + "AWS_FIREHOSE_DELIVERY_STREAM_NAME" = "dev-sendgrid-events-to-braveheart"
              + "ENVIRONMENT"                       = "development"
              + "GIT_SHA"                           = (sensitive value)
              + "SENTRY_DSN"                        = (sensitive value)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0cd18cc5aad4faa4f",
            ]
          + subnet_ids                  = [
              + "subnet-04478ac1c55709b1f",
              + "subnet-07854aac95d07bb16",
              + "subnet-0a6c00fa564f97b10",
              + "subnet-0eb99fe10e08d5d96",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309 will be created
  + resource "aws_lambda_permission" "apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "SendGridData-Dev-ApiGateway-Function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "DEPLOYED"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571 will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4 will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sendgrid-data.getpocket.dev"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C will be created
  + resource "aws_route53_record" "apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sendgrid-data.getpocket.dev"
      + records         = (known after apply)
      + ttl             = 86400
      + type            = "NS"
      + zone_id         = "ZCSIDA846KWLN"
    }

  # aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733 will be created
  + resource "aws_route53_zone" "apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sendgrid-data.getpocket.dev"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683 will be created
  + resource "aws_s3_bucket" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "pocket-sendgriddata-dev-apigateway"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214 will be created
  + resource "aws_s3_bucket_acl" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1 will be created
  + resource "aws_s3_bucket_ownership_controls" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A will be created
  + resource "aws_s3_bucket_public_access_block" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 29 to add, 0 to change, 0 to destroy.
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633: Creating...
aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA: Creating...
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B: Creating...
aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA: Creating...
aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B: Creating...
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Creating...
aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683: Creating...
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Creating...
aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA: Creation complete after 1s [id=arn:aws:iam::410318598490:policy/SendGridData-Dev-ApiGateway-ExecutionRolePolicy]
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633: Creation complete after 1s [id=SendGridData-Dev-ApiGateway-ExecutionRole]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2: Creating...
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Creating...
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B: Creation complete after 1s [id=SendGridData-Dev-ApiGateway-CodeDeployRole]
aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B: Creation complete after 1s [id=c4289a05-c93d-4432-8bf2-659679caa806:SendGridData-Dev-ApiGateway-Lambda]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87: Creating...
aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54: Creating...
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2: Creation complete after 0s [id=SendGridData-Dev-ApiGateway-ExecutionRole-20240110231530742700000003]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87: Creation complete after 0s [id=SendGridData-Dev-ApiGateway-CodeDeployRole-20240110231530761400000004]
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Creation complete after 1s [id=yz6x5li9y0]
aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204: Creating...
aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204: Creation complete after 0s [id=r0dngj]
aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7: Creating...
aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7: Creation complete after 0s [id=agm-yz6x5li9y0-r0dngj-POST]
aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA: Creation complete after 6s [id=arn:aws:acm:us-east-1:410318598490:certificate/d291e1a6-f4ef-4986-b6f5-cc5a3a618fc0]
aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54: Creation complete after 8s [id=2b920771-b2b2-4ab2-9577-53c8354fa058]
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Still creating... [10s elapsed]
aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683: Still creating... [10s elapsed]
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Still creating... [10s elapsed]
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Creation complete after 15s [id=SendGridData-Dev-ApiGateway-Function]
aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26: Creating...
aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F: Creating...
aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F: Creation complete after 0s [id=arn:aws:lambda:us-east-1:410318598490:function:SendGridData-Dev-ApiGateway-Function:DEPLOYED]
aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884: Creating...
aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26: Creation complete after 0s [id=/aws/lambda/SendGridData-Dev-ApiGateway-Function]
aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884: Creation complete after 0s [id=agi-yz6x5li9y0-r0dngj-POST]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creating...
aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683: Creation complete after 16s [id=pocket-sendgriddata-dev-apigateway]
aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A: Creating...
aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1: Creating...
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creation complete after 1s [id=2q5jzo]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Creating...
aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A: Creation complete after 1s [id=pocket-sendgriddata-dev-apigateway]
aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1: Creation complete after 1s [id=pocket-sendgriddata-dev-apigateway]
aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214: Creating...
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Creation complete after 0s [id=ags-yz6x5li9y0-dev]
aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309: Creating...
aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214: Creation complete after 0s [id=pocket-sendgriddata-dev-apigateway,private]
aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309: Creation complete after 0s [id=terraform-20240110231546778900000005]
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Still creating... [20s elapsed]
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Still creating... [30s elapsed]
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Still creating... [40s elapsed]
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Creation complete after 50s [id=Z087040334NE8PGMB8N3C]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Creating...
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Creating...
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Still creating... [10s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Still creating... [10s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Still creating... [20s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Still creating... [20s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Still creating... [30s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Still creating... [30s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Still creating... [40s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Still creating... [40s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Creation complete after 47s [id=Z087040334NE8PGMB8N3C__a619665826c77afdc4164923662d6617.sendgrid-data.getpocket.dev._CNAME]
aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637: Creating...
aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637: Creation complete after 0s [id=2024-01-10 23:16:48.37 +0000 UTC]
aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4: Creating...
aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4: Creation complete after 3s [id=sendgrid-data.getpocket.dev]
aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422: Creating...
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Creating...
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Still creating... [50s elapsed]
aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422: Creation complete after 0s [id=sendgrid-data.getpocket.dev/]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Creation complete after 55s [id=ZCSIDA846KWLN_sendgrid-data.getpocket.dev_NS]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Still creating... [10s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Still creating... [20s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Still creating... [30s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Still creating... [40s elapsed]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Creation complete after 47s [id=Z087040334NE8PGMB8N3C_sendgrid-data.getpocket.dev_A]

Apply complete! Resources: 29 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"87031ffa-c88a-448c-85c9-a47136481d50","JobName":"sendgrid-data_infrastructure_apply_dev","PRNumber":56,"Program":"tfcmt","SHA1":"a57bd820cd688826c2b686f18cf5b94a5816cd26","Target":"sendgrid-data-cdk-dev","Vars":{}} -->